---
title: DistributionSysTypeSetIterator
classe: Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# DistributionSysTypeSetIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Object Current { get; }` | `distributionSysTypeSetIterator.Current` | Object |
| `Boolean MoveNext()` | `distributionSysTypeSetIterator.MoveNext()` | Boolean |
| `Void Reset()` | `distributionSysTypeSetIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```